{"keras_version": "2.1.5", "config": {"layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 28, 28, 1], "name": "input_1", "sparse": false}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"dilation_rate": [1, 1], "trainable": true, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_regularizer": null, "name": "conv2d_1", "kernel_constraint": null, "use_bias": true, "kernel_size": [3, 3], "filters": 32, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"padding": "same", "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"dilation_rate": [1, 1], "trainable": true, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_regularizer": null, "name": "conv2d_2", "kernel_constraint": null, "use_bias": true, "kernel_size": [3, 3], "filters": 16, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"config": {"padding": "same", "trainable": true, "name": "max_pooling2d_2", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D", "name": "max_pooling2d_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"dilation_rate": [1, 1], "trainable": true, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_regularizer": null, "name": "conv2d_3", "kernel_constraint": null, "use_bias": true, "kernel_size": [3, 3], "filters": 16, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "up_sampling2d_1", "data_format": "channels_last", "size": [2, 2]}, "class_name": "UpSampling2D", "name": "up_sampling2d_1", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"config": {"dilation_rate": [1, 1], "trainable": true, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_regularizer": null, "name": "conv2d_4", "kernel_constraint": null, "use_bias": true, "kernel_size": [3, 3], "filters": 32, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "up_sampling2d_2", "data_format": "channels_last", "size": [2, 2]}, "class_name": "UpSampling2D", "name": "up_sampling2d_2", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"config": {"dilation_rate": [1, 1], "trainable": true, "activation": "sigmoid", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "bias_regularizer": null, "name": "conv2d_5", "kernel_constraint": null, "use_bias": true, "kernel_size": [3, 3], "filters": 1, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]]}], "output_layers": [["conv2d_5", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "class_name": "Model", "backend": "tensorflow"}